강의에 대한 지적사항은 tjdwls98280@gmail.com 으로 메일 부탁드립니다.

본 Step.1 에서는 파이썬을 친숙하게 다가가기위해 잠깐 둘러보는 느낌으로 시작할 것 이다.

파이썬은 https://www.python.org/ 공식 홈페이지에서 다운로드, 설치가 가능하다.

공식홈페이지에서 다운로드, 설치뒤에 시작 프로그램창에 설치되어있는 Python IDLE 를 실행하자.

>>>

이런 식의 Command 를 입력하라는 뜻의 부등호 3개가 보일것이다. 우리는 이제 이 부등호 옆에 명령어(Command) 를 입력할 것 이다.

이제 간단한 사칙연산을 위해 아래와 같이 입력해보자

>>> 3 + 4
7
>>> 4 - 3
1
>>> 3 * 4
12
>>> 6 / 3
2

이렇게 결과값이 바로바로 나올 것 이다.

이처럼 파이썬은 간단하면서도 인간적인 프로그래밍 언어이다. 아울러 위처럼 사칙연산을 위해서 C언어와 JAVA 프로그래밍 언어에서는 변수를 지정해준뒤
변수값의 변형을 통해 연산을 해야 하는데, 파이썬은 커맨드라인에 바로 입력하면서, 즉각즉각 원하는 결과값을 내놓는다.

그럼 다음으로는 간단한 문자 출력(print)를 해보자.

>>> print("Hello! SeongJinHong")
Hello! SeongJinHong

위 명령어는 뜻 그대로 print("출력을 원하는 문자열") 을 입력하면, 즉각 명령어를 시행하여 결과값을 내놓는다. print 는 출력 이란 뜻을 갖고있는 단어이므로,
눈치가 빠른 프로그래밍 입문자 혹은 프로그래머 는 바로 이해할 것 이다.

물론 숫자 및 여러가지 문자를 표현할 수 있다.

>>> print("Hi, My e-mail address is python123@starter.net")
Hi, My e-mail address is python123@starter.net

그리고 위에서 사칙연산을 했던 명령어도 파이썬 출력 명령어에 대입하여 사용이 가능하다. 예제를 보며 익혀보자.

>>> print(4+4)
8
>>> print(4-3)
1
>>> print(3*4)
12
>>> print(6/3)
2

명령어 그대로 print(원하는_사칙연산_식) 을 입력하면 바로 그대로 print 해주는 명령어 이다. 눈치가 빠를 필요없이 바로 보면 알 수 있는 명령어이다.

이번 시간에는 파이썬을 둘러보고 친숙하게 다가가기 위한 기초 예제 맛보기이다. 파이썬은 입문하기가 쉬우며 추후에도 무궁무진한 발전성과 수요가 높은
프로그래밍 언어이므로 공부하면 매우 좋은 프로그래밍 언어가 될 것 이다.
