불리언 자료형은 참과 거짓을 나타내는데 주로 사용되는 자료형이다. 여기서 주로 다루는 건 불린 자료형에 대해 간단히 알아보는 정도면 된다.
추후에 if나 while문에서 사용하다보면 자연스레 완벽해질 것 이다.

영국의 수학자인 조지 불의 이름에서 따오게 되었다고 한다.

Boolean 자료형은 아래 두가지의 값만 소유할 수 있다.

○ True = 참
○ False = 거짓

※ 프로그래밍시에 불린 자료형 True, False 는 꼭 첫 문자는 대문자로 적어야 한다.

>>> 5 == 5
True

>>> 1 == 2
False

>>> 1 != 1     # 1과 1은 같지않다
False          # 거짓

>>> 2 > 1
True

>>> 2 < 1
False

>>> 5 >= 1   # 5는 1보다 크거나 같다
True

>>> 5 <= 1   # 5는 1보다 작거나 같다
False

>>> test_list = [1, 2, 3, 4]     # test_list 라는 이름의 리스트에 1, 2, 3, 4를 입력
>>> test_list_2 = [1, 2, 3, 4, 5]    # test_list_2 라는 이름의 리스트에 1, 2, 3, 4, 5를 입력
>>> test_list == test_list_2       # test_list와 test_list_2 리스트의 값이 서로 같은지 체크
>>> False

>>> 1+1 == 3
False

>>> 3/2 == 1.5
True

여기까지의 수식을 이해했다면 이뒤에 강의할 내용에서 다루는 Boolean 자료형을 응용한건 문제없이 이어나갈 수 있다.

여기까지 자료형에 대해 알아보았다! 자료형만 완벽하면 프로그래밍의 50% 이상은 이해한 것과 마찬가지리라 필자는 생각한다.

자료형은 프로그래밍에서 매우 중요한 요소이므로 꼭 열심히 공부하도록 하자.
